import pandas as pd

# Pandas에 있는 리스트
a = pd.Series([1414, 4453, 5346, 6454])
print(a)
print(a[0])
print("----------------------------------------")

b = pd.DataFrame()
b["이름"] = ["새우깡", "양파링"]
b["가격"] = [3000, 4000]
print(b)
print("----------------------------------------")
print(b["이름"])
print("----------------------------------------")

# 탐색 기준 : index
b = b.set_index(b["이름"])
print(b)
print("----------------------------------------")

# 설정한 index로 데이터 찾기
print(b.loc["새우깡"])
print("----------------------------------------")

# 번호로 데이터 찾기
print(b.iloc[1])
print("----------------------------------------")